<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /> 



<div align="right"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" />&nbsp;2&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;5&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />&nbsp;8&nbsp;Low</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I02-I-NSG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/azure.svg" /></sub></td>

<td>tf-test</td>

<td>Inbound "From Any allow all TCP" rules from Public IPs</td>

</tr>
<tr>

<td>Auto01</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>Administrative port 22 (ssh) open to more than 256 IPs from the Internet</td>

</tr>
<tr>

<td>I05-I-SG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>TCP on all ports can enter your network from Public IPs</td>

</tr>
<tr>

<td>I01-NI-GCP</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></sub></td>

<td>tf-test</td>

<td>"Any" service can enter your network from Private IPs</td>

</tr>
<tr>

<td>I02-NI-GCP</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></sub></td>

<td>tf-test</td>

<td>TCP on all ports can enter your network from Private IPs</td>

</tr>
<tr>

<td>I03-NI-GCP</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></sub></td>

<td>tf-test</td>

<td>UDP on all ports can enter your network from Private IPs</td>

</tr>
<tr>

<td>I03-NI-SG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>UDP on all ports can enter your network from Private IPs</td>

</tr>
<tr>

<td>I21-NI-SG</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>Administrative port 22 (ssh) can enter your network from more than 256 Private IPs</td>

</tr>
<tr>

<td>Auto02</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>Administrative port 100 is also very risky</td>

</tr>
<tr>

<td>Auto05</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>Part Range 1020-1050</td>

</tr>
<tr>

<td>Auto06</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>And Test</td>

</tr>
<tr>

<td>Auto07</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/aws.svg" /></sub></td>

<td>tf-test</td>

<td>CIDR test</td>

</tr>
<tr>

<td>AutoAzureNSG_Ports</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/azure.svg" /></sub></td>

<td>tf-test</td>

<td>Administrative port 99 (ssh99) open to more than 256 IPs from the Internet</td>

</tr>
<tr>

<td>AutoAzureNSG_Source</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/azure.svg" /></sub></td>

<td>tf-test</td>

<td>sourceAddressPrefix * on Inbound</td>

</tr>
<tr>

<td>AutoAzureNSG_PublicIps</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/azure.svg" /></sub></td>

<td>tf-test</td>

<td>public IPs >0</td>

</tr>
<tr>

<td>AutoAzureNSG_PublicIpsThreshold</td>

<td align="center"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" /></td>

<td align="center"><sub><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/azure.svg" /></sub></td>

<td>tf-test</td>

<td>public IPs >5</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></sub></sub></sub>&nbsp;&nbsp;<h3><b>tf-test</b></h3><div  align="right"><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />&nbsp;1&nbsp;Critical&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" />&nbsp;2&nbsp;High&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />&nbsp;5&nbsp;Medium&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />&nbsp;8&nbsp;Low</div></summary>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/critical.svg" />  I02-I-NSG</summary> 

### **Title:**
Inbound "From Any allow all TCP" rules from Public IPs

### **Description:**
Inbound rules of the form "From Any with all TCP : PASS" are usually more open than is necessary. Allowing all TCP allows many services that are known to be risky, most of which you probably do not use in your business. Allowing access from all sources may allow access to from risky locations. This subnet is connected to the Internet, elevating the level of risk.

### **Recommendation:**
Restrict the rules to refer to only the source IPs and services you really use.

### **Details:**

```

[
	{
		"vendor": "Azure",
		"source": "example2/acceptanceTestSecurityGroup1/test1234",
		"toPort": "*",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "*"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" />  Auto01</summary> 

### **Title:**
Administrative port 22 (ssh) open to more than 256 IPs from the Internet

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.10.7.0/24"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.9.0.0/16"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.8.8.123/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.8.8.156/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.8.11.7/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_CommitFailures_234",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.10.0.0/16"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.svg" />  I05-I-SG</summary> 

### **Title:**
TCP on all ports can enter your network from Public IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require. 

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I01-NI-GCP</summary> 

### **Title:**
"Any" service can enter your network from Private IPs

### **Description:**
Allowing the "Any" service to enter your network is extremely risky since the "Any" service includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs.

### **Recommendation:**
Review all the rules that allow inbound traffic with "Any" service, and limit them to those services you actually require.  

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "risk-to-rule1",
		"ipProtocol": "all",
		"ipRange": [
			"192.168.1.1/32"
		]
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I02-NI-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Private IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus.

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require.  

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i02-ni-gcp",
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i04-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i05-ni-gcp",
		"toPort": 3020,
		"fromPort": 3020,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i13-ni-gcp",
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i18-ni-gcp",
		"toPort": 111,
		"fromPort": 111,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I03-NI-GCP</summary> 

### **Title:**
UDP on all ports can enter your network from Private IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 
    

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you 
actually require. 

### **Details:**

```

[
	{
		"vendor": "GCP",
		"source": "i04-ni-gcp",
		"toPort": 389,
		"fromPort": 389,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i05-ni-gcp",
		"toPort": 3020,
		"fromPort": 3020,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "i18-ni-gcp",
		"toPort": 111,
		"fromPort": 111,
		"ipProtocol": "tcp",
		"ipRange": [
			"192.168.1.1/32"
		]
	},
	{
		"vendor": "GCP",
		"source": "risk-to-rule2",
		"ipProtocol": "udp",
		"ipRange": [
			"192.168.1.1/32"
		]
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I03-NI-SG</summary> 

### **Title:**
UDP on all ports can enter your network from Private IPs

### **Description:**
Allowing UDP on all ports to enter your network is extremely risky since this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus. 
    

### **Recommendation:**
Review all the rules that allow inbound traffic with UDP on all ports, and limit them to those services you 
actually require. 

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "udp",
		"ipRange": "10.7.0.0/16"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "udp",
		"ipRange": "10.7.0.0/16"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" />  I21-NI-SG</summary> 

### **Title:**
Administrative port 22 (ssh) can enter your network from more than 256 Private IPs

### **Description:**
Allowing access from more than 256 Private IP addresses using the SSH service (TCP/22) is risky.  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from too many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_SSH_123",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.9.0.0/16"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroup_CommitFailures_234",
		"toPort": 22,
		"fromPort": 22,
		"ipProtocol": "tcp",
		"ipRange": "10.10.0.0/16"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  Auto02</summary> 

### **Title:**
Administrative port 100 is also very risky

### **Description:**
some very special description

### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  Auto05</summary> 

### **Title:**
Part Range 1020-1050

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "udp",
		"ipRange": "10.7.0.0/16"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "udp",
		"ipRange": "10.7.0.0/16"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  Auto06</summary> 

### **Title:**
And Test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 65535,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": "31.154.25.138/32"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  Auto07</summary> 

### **Title:**
CIDR test

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**

```

[
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest2_345",
		"toPort": 10002,
		"fromPort": 8081,
		"ipProtocol": "tcp",
		"ipRange": "0.0.0.0/0"
	},
	{
		"vendor": "AWS",
		"source": "AutoSecurityGroupUnAssignedTest3_456",
		"toPort": 10002,
		"fromPort": 8081,
		"ipProtocol": "tcp",
		"ipRange": "0.0.0.0/0"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  AutoAzureNSG_Ports</summary> 

### **Title:**
Administrative port 99 (ssh99) open to more than 256 IPs from the Internet

### **Description:**
automation ports

### **Recommendation:**
automation ports

### **Details:**

```

[
	{
		"vendor": "Azure",
		"source": "example2/acceptanceTestSecurityGroup1/test1234",
		"toPort": "*",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "*"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  AutoAzureNSG_Source</summary> 

### **Title:**
sourceAddressPrefix * on Inbound

### **Description:**
Source address *

### **Recommendation:**
AA

### **Details:**

```

[
	{
		"vendor": "Azure",
		"source": "example2/acceptanceTestSecurityGroup1/test1234",
		"toPort": "*",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "*"
	},
	{
		"vendor": "Azure",
		"source": "testrules/http",
		"toPort": "80",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "192.168.2.0/24"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  AutoAzureNSG_PublicIps</summary> 

### **Title:**
public IPs >0

### **Description:**
Public IPs >0

### **Recommendation:**
AA

### **Details:**

```

[
	{
		"vendor": "Azure",
		"source": "example2/acceptanceTestSecurityGroup1/test1234",
		"toPort": "*",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "*"
	},
	{
		"vendor": "Azure",
		"source": "testrules/http",
		"toPort": "80",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "192.168.2.0/24"
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.svg" />  AutoAzureNSG_PublicIpsThreshold</summary> 

### **Title:**
public IPs >5

### **Description:**
Public IPs >5

### **Recommendation:**
AA

### **Details:**

```

[
	{
		"vendor": "Azure",
		"source": "example2/acceptanceTestSecurityGroup1/test1234",
		"toPort": "*",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "*"
	},
	{
		"vendor": "Azure",
		"source": "testrules/http",
		"toPort": "80",
		"fromPort": "*",
		"ipProtocol": "TCP",
		"ipRange": "192.168.2.0/24"
	}
]

```

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "cloudfront_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "this-is-a-test"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + include_cookies = false
          + prefix          = "logs"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "this-is-a-test"
          + origin_id           = "this-is-a-test/cloudflow"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_security_group.AutoSecurityGroupSSHBase will be created
  + resource "aws_security_group" "AutoSecurityGroupSSHBase" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroup_SSH"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh to anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.7.0/24",
                  + "10.9.0.0/16",
                  + "10.8.8.123/32",
                  + "10.8.8.156/32",
                  + "10.8.11.7/32",
                  + "31.154.25.138/32",
                ]
              + description      = "ssh incoming"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AutoSecurityGroup_SSH_123"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.AutoSecurityGroupUnAssignedTest2 will be created
  + resource "aws_security_group" "AutoSecurityGroupUnAssignedTest2" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroupUnAssignedTest2"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "UDP 11000 allow"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh allow"
              + from_port        = 11000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 11000
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "#rk65j43po.Acg,mfr$56#@!(){}[]"
              + from_port        = 7080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 7080
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "387-389 allow to me"
              + from_port        = 387
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "7.7.7.7/32",
                ]
              + description      = "ICMP all allow to 7.7.7.7"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                  + "10.0.3.0/24",
                  + "10.0.4.0/24",
                ]
              + description      = "UDP_Range_to_SubnetsAndIp"
              + from_port        = 20000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 20124
            },
          + {
              + cidr_blocks      = [
                  + "10.12.14.15/32",
                ]
              + description      = "CMP_IPV6_rules"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmpv6"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "10.7.0.0/16",
                ]
              + description      = "ALL UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.9.8.9/32",
                  + "10.11.9.7/32",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "All TCP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "ICMP_Traceroute_to_MyIP"
              + from_port        = 30
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.139/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
        ]
      + name                   = "AutoSecurityGroupUnAssignedTest2_345"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.AutoSecurityGroupUnAssignedTest3 will be created
  + resource "aws_security_group" "AutoSecurityGroupUnAssignedTest3" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroupUnAssignedTest3"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "UDP 11000 allow"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh allow"
              + from_port        = 11000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 11000
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "#rk65j43po.Acg,mfr$56#@!(){}[]"
              + from_port        = 7080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 7080
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "LDAP allow to me"
              + from_port        = 389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 389
            },
          + {
              + cidr_blocks      = [
                  + "7.7.7.7/32",
                ]
              + description      = "ICMP all allow to 7.7.7.7"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = []
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "custom tcp allow to any"
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10002
            },
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/24",
                  + "10.0.3.0/24",
                ]
              + description      = "UDP_Range_to_SubnetsAndIp"
              + from_port        = 20000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 20124
            },
          + {
              + cidr_blocks      = [
                  + "10.12.14.15/32",
                ]
              + description      = "CMP_IPV6_rules"
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmpv6"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "10.7.0.0/16",
                ]
              + description      = "ALL UDP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "10.9.8.9/32",
                  + "10.11.9.7/32",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = ""
              + from_port        = 3389
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3389
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "All TCP"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = [
                  + "31.154.25.138/32",
                ]
              + description      = "ICMP_Traceroute_to_MyIP"
              + from_port        = 30
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + name                   = "AutoSecurityGroupUnAssignedTest3_456"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.CommitFailures will be created
  + resource "aws_security_group" "CommitFailures" {
      + arn                    = (known after apply)
      + description            = "AutoSecurityGroup_CommitFailures"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "ssh to anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "ssh incoming"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "AutoSecurityGroup_CommitFailures_234"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-014ba11d74c3fad72"
    }

  # aws_security_group.devsecops_test will be created
  + resource "aws_security_group" "devsecops_test" {
      + arn                    = (known after apply)
      + description            = "Display devsecops "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.20.30.0/24",
                ]
              + description      = ""
              + from_port        = 7654
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 7655
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "web app"
              + from_port        = 1080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8082
            },
        ]
      + name                   = "devsecops_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cool_application"
        }
      + tags_all               = {
          + "Name" = "cool_application"
        }
      + vpc_id                 = "vpc-12345678"
    }

  # azurerm_network_security_group.example will be created
  + resource "azurerm_network_security_group" "example" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "devsecops-nsg"
      + resource_group_name = "devsecops-resources"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_group.example2 will be created
  + resource "azurerm_network_security_group" "example2" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "acceptanceTestSecurityGroup1"
      + resource_group_name = "devsecops-resources"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "*"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "test1234"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "Production"
        }
    }

  # azurerm_network_security_rule.testrules["http"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "192.168.2.0/24"
      + destination_port_range      = "80"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "http"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 201
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.testrules["rdp"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "rdp"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.testrules["sql"] will be created
  + resource "azurerm_network_security_rule" "testrules" {
      + access                      = "Allow"
      + destination_address_prefix  = "192.168.2.0/24"
      + destination_port_range      = "1433"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "sql"
      + network_security_group_name = "devsecops-nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "devsecops-resources"
      + source_address_prefix       = "SqlManagement"
      + source_port_range           = "*"
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "devsecops-resources"
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "devsecops-resources"
      + virtual_network_name                           = "devsecops-network"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "devsecops-network"
      + resource_group_name = "devsecops-resources"
      + subnet              = (known after apply)
    }

  # google_compute_firewall.disabled-rule will be created
  + resource "google_compute_firewall" "disabled-rule" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "7.7.7.7/32",
        ]
      + direction          = "EGRESS"
      + disabled           = true
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "disabled-rule"
      + network            = "network-with-disabled-rule"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i02-ni-gcp will be created
  + resource "google_compute_firewall" "i02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i02-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i04-ni-gcp will be created
  + resource "google_compute_firewall" "i04-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i04-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "389",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i05-ni-gcp will be created
  + resource "google_compute_firewall" "i05-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i05-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "3020",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "3020",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.i13-ni-gcp will be created
  + resource "google_compute_firewall" "i13-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i13-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "135",
              + "139",
              + "445",
              + "593",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.i18-ni-gcp will be created
  + resource "google_compute_firewall" "i18-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "i18-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = [
              + "111",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "111",
            ]
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o01-ni-gcp will be created
  + resource "google_compute_firewall" "o01-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o01-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.o02-ni-gcp will be created
  + resource "google_compute_firewall" "o02-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o02-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.o03-ni-gcp will be created
  + resource "google_compute_firewall" "o03-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o03-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_firewall.o04-ni-gcp will be created
  + resource "google_compute_firewall" "o04-ni-gcp" {
      + creation_timestamp = (known after apply)
      + destination_ranges = [
          + "192.168.1.1/32",
        ]
      + direction          = "EGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "o04-ni-gcp"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)

      + allow {
          + ports    = [
              + "135",
              + "139",
              + "445",
              + "539",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.qa-auto-service-account-rule will be created
  + resource "google_compute_firewall" "qa-auto-service-account-rule" {
      + creation_timestamp      = (known after apply)
      + destination_ranges      = [
          + "0.0.0.0/0",
        ]
      + direction               = "EGRESS"
      + enable_logging          = (known after apply)
      + id                      = (known after apply)
      + name                    = "qa-auto-service-account-rule"
      + network                 = "terraform-network"
      + priority                = 1000
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + target_service_accounts = [
          + "qa-service-account-id@cloudflow-qa-gcp1.iam.gserviceaccount.com",
        ]

      + allow {
          + ports    = [
              + "8888",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.risk-to-rule1 will be created
  + resource "google_compute_firewall" "risk-to-rule1" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "risk-to-rule1"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "all"
        }
    }

  # google_compute_firewall.risk-to-rule2 will be created
  + resource "google_compute_firewall" "risk-to-rule2" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "risk-to-rule2"
      + network            = "terraform-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "192.168.1.1/32",
        ]

      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_network.network-with-disabled-rule will be created
  + resource "google_compute_network" "network-with-disabled-rule" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "network-with-disabled-rule"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_service_account.qa_auto_service_account will be created
  + resource "google_service_account" "qa_auto_service_account" {
      + account_id   = "qa-service-account-id"
      + disabled     = false
      + display_name = "QA Auto Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 29 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example/tf-test\tmp\tf-tf-test.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example/tf-test\\tmp\\tf-tf-test.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---


<br>
Pusher: @VITALYALGOSEC<br>
Action: `pull_request`<br>
Working Directory: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example<br>
Workflow: Customer Repo CI/CD